GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18lf26k83.inc
CM1CON0          EQU  H'3EBC'
CM1CON1          EQU  H'3EBD'
CM1NCH           EQU  H'3EBE'
CM1PCH           EQU  H'3EBF'
CMOUT            EQU  H'3EC0'
FVRCON           EQU  H'3EC1'
ZCDCON           EQU  H'3EC3'
HLVDCON0         EQU  H'3EC9'
HLVDCON1         EQU  H'3ECA'
ADCP             EQU  H'3ED7'
ADLTH            EQU  H'3EDE'
ADLTHL           EQU  H'3EDE'
ADLTHH           EQU  H'3EDF'
ADUTH            EQU  H'3EE0'
ADUTHL           EQU  H'3EE0'
ADUTHH           EQU  H'3EE1'
ADERR            EQU  H'3EE2'
ADERRL           EQU  H'3EE2'
ADERRH           EQU  H'3EE3'
ADSTPT           EQU  H'3EE4'
ADSTPTL          EQU  H'3EE4'
ADSTPTH          EQU  H'3EE5'
ADFLTR           EQU  H'3EE6'
ADFLTRL          EQU  H'3EE6'
ADFLTRH          EQU  H'3EE7'
ADACC            EQU  H'3EE8'
ADACCL           EQU  H'3EE8'
ADACCH           EQU  H'3EE9'
ADACCU           EQU  H'3EEA'
ADCNT            EQU  H'3EEB'
ADRPT            EQU  H'3EEC'
ADPREV           EQU  H'3EED'
ADPREVL          EQU  H'3EED'
ADPREVH          EQU  H'3EEE'
ADRES            EQU  H'3EEF'
ADRESL           EQU  H'3EEF'
ADRESH           EQU  H'3EF0'
ADPCH            EQU  H'3EF1'
ADACQ            EQU  H'3EF3'
ADACQL           EQU  H'3EF3'
ADACQH           EQU  H'3EF4'
ADCAP            EQU  H'3EF5'
ADPRE            EQU  H'3EF6'
ADPREL           EQU  H'3EF6'
ADPREH           EQU  H'3EF7'
ADCON0           EQU  H'3EF8'
ADCON1           EQU  H'3EF9'
ADCON2           EQU  H'3EFA'
ADCON3           EQU  H'3EFB'
ADSTAT           EQU  H'3EFC'
ADREF            EQU  H'3EFD'
ADACT            EQU  H'3EFE'
ADCLK            EQU  H'3EFF'
SMT2TMR          EQU  H'3F00'
SMT2TMRL         EQU  H'3F00'
SMT2TMRH         EQU  H'3F01'
SMT2TMRU         EQU  H'3F02'
SMT2CPR          EQU  H'3F03'
SMT2CPRL         EQU  H'3F03'
SMT2CPRH         EQU  H'3F04'
SMT2CPRU         EQU  H'3F05'
SMT2CPW          EQU  H'3F06'
SMT2CPWL         EQU  H'3F06'
SMT2CPWH         EQU  H'3F07'
SMT2CPWU         EQU  H'3F08'
SMT2PR           EQU  H'3F09'
SMT2PRL          EQU  H'3F09'
SMT2PRH          EQU  H'3F0A'
SMT2PRU          EQU  H'3F0B'
SMT2CON0         EQU  H'3F0C'
SMT2CON1         EQU  H'3F0D'
SMT2STAT         EQU  H'3F0E'
SMT2CLK          EQU  H'3F0F'
SMT2SIG          EQU  H'3F10'
SMT2WIN          EQU  H'3F11'
SMT1TMR          EQU  H'3F12'
SMT1TMRL         EQU  H'3F12'
SMT1TMRH         EQU  H'3F13'
SMT1TMRU         EQU  H'3F14'
SMT1CPR          EQU  H'3F15'
SMT1CPRL         EQU  H'3F15'
SMT1CPRH         EQU  H'3F16'
SMT1CPRU         EQU  H'3F17'
SMT1CPW          EQU  H'3F18'
SMT1CPWL         EQU  H'3F18'
SMT1CPWH         EQU  H'3F19'
SMT1CPWU         EQU  H'3F1A'
SMT1PR           EQU  H'3F1B'
SMT1PRL          EQU  H'3F1B'
SMT1PRH          EQU  H'3F1C'
SMT1PRU          EQU  H'3F1D'
SMT1CON0         EQU  H'3F1E'
SMT1CON1         EQU  H'3F1F'
SMT1STAT         EQU  H'3F20'
SMT1CLK          EQU  H'3F21'
SMT1SIG          EQU  H'3F22'
SMT1WIN          EQU  H'3F23'
NCO1ACC          EQU  H'3F38'
NCO1ACCL         EQU  H'3F38'
NCO1ACCH         EQU  H'3F39'
NCO1ACCU         EQU  H'3F3A'
NCO1INC          EQU  H'3F3B'
NCO1INCL         EQU  H'3F3B'
NCO1INCH         EQU  H'3F3C'
NCO1INCU         EQU  H'3F3D'
NCO1CON          EQU  H'3F3E'
NCO1CLK          EQU  H'3F3F'
CWG3CLK          EQU  H'3F40'
CWG3CLKCON       EQU  H'3F40'
CWG3ISM          EQU  H'3F41'
CWG3DBR          EQU  H'3F42'
CWG3DBF          EQU  H'3F43'
CWG3CON0         EQU  H'3F44'
CWG3CON1         EQU  H'3F45'
CWG3AS0          EQU  H'3F46'
CWG3AS1          EQU  H'3F47'
CWG3STR          EQU  H'3F48'
CWG2CLK          EQU  H'3F49'
CWG2CLKCON       EQU  H'3F49'
CWG2ISM          EQU  H'3F4A'
CWG2DBR          EQU  H'3F4B'
CWG2DBF          EQU  H'3F4C'
CWG2CON0         EQU  H'3F4D'
CWG2CON1         EQU  H'3F4E'
CWG2AS0          EQU  H'3F4F'
CWG2AS1          EQU  H'3F50'
CWG2STR          EQU  H'3F51'
CWG1CLK          EQU  H'3F52'
CWG1CLKCON       EQU  H'3F52'
CWG1ISM          EQU  H'3F53'
CWG1DBR          EQU  H'3F54'
CWG1DBF          EQU  H'3F55'
CWG1CON0         EQU  H'3F56'
CWG1CON1         EQU  H'3F57'
CWG1AS0          EQU  H'3F58'
CWG1AS1          EQU  H'3F59'
CWG1STR          EQU  H'3F5A'
CCPTMRS0         EQU  H'3F5E'
CCPTMRS1         EQU  H'3F5F'
PWM8DC           EQU  H'3F60'
PWM8DCL          EQU  H'3F60'
PWM8DCH          EQU  H'3F61'
PWM8CON          EQU  H'3F62'
PWM7DC           EQU  H'3F64'
PWM7DCL          EQU  H'3F64'
PWM7DCH          EQU  H'3F65'
PWM7CON          EQU  H'3F66'
PWM6DC           EQU  H'3F68'
PWM6DCL          EQU  H'3F68'
PWM6DCH          EQU  H'3F69'
PWM6CON          EQU  H'3F6A'
PWM5DC           EQU  H'3F6C'
PWM5DCL          EQU  H'3F6C'
PWM5DCH          EQU  H'3F6D'
PWM5CON          EQU  H'3F6E'
CCPR4            EQU  H'3F70'
CCPR4L           EQU  H'3F70'
CCPR4H           EQU  H'3F71'
CCP4CON          EQU  H'3F72'
CCP4CAP          EQU  H'3F73'
CCPR3            EQU  H'3F74'
CCPR3L           EQU  H'3F74'
CCPR3H           EQU  H'3F75'
CCP3CON          EQU  H'3F76'
CCP3CAP          EQU  H'3F77'
CCPR2            EQU  H'3F78'
CCPR2L           EQU  H'3F78'
CCPR2H           EQU  H'3F79'
CCP2CON          EQU  H'3F7A'
CCP2CAP          EQU  H'3F7B'
CCPR1            EQU  H'3F7C'
CCPR1L           EQU  H'3F7C'
CCPR1H           EQU  H'3F7D'
CCP1CON          EQU  H'3F7E'
CCP1CAP          EQU  H'3F7F'
RXB0CON          EQU  H'3F80'
RXB0SIDH         EQU  H'3F81'
RXB0SIDL         EQU  H'3F82'
RXB0EIDH         EQU  H'3F83'
RXB0EIDL         EQU  H'3F84'
RXB0DLC          EQU  H'3F85'
RXB0D0           EQU  H'3F86'
RXB0D1           EQU  H'3F87'
RXB0D2           EQU  H'3F88'
RXB0D3           EQU  H'3F89'
RXB0D4           EQU  H'3F8A'
RXB0D5           EQU  H'3F8B'
RXB0D6           EQU  H'3F8C'
RXB0D7           EQU  H'3F8D'
CANSTAT          EQU  H'3F8E'
CANCON           EQU  H'3F8F'
COMSTAT          EQU  H'3F90'
ECANCON          EQU  H'3F91'
T6TMR            EQU  H'3F92'
TMR6             EQU  H'3F92'
PR6              EQU  H'3F93'
T6PR             EQU  H'3F93'
T6CON            EQU  H'3F94'
T6HLT            EQU  H'3F95'
T6CLK            EQU  H'3F96'
T6CLKCON         EQU  H'3F96'
T6RST            EQU  H'3F97'
TMR5L            EQU  H'3F98'
TMR5H            EQU  H'3F99'
T5CON            EQU  H'3F9A'
TMR5CON          EQU  H'3F9A'
T5GCON           EQU  H'3F9B'
TMR5GCON         EQU  H'3F9B'
T5GATE           EQU  H'3F9C'
TMR5GATE         EQU  H'3F9C'
T5CLK            EQU  H'3F9D'
TMR5CLK          EQU  H'3F9D'
T4TMR            EQU  H'3F9E'
TMR4             EQU  H'3F9E'
PR4              EQU  H'3F9F'
T4PR             EQU  H'3F9F'
T4CON            EQU  H'3FA0'
T4HLT            EQU  H'3FA1'
T4CLK            EQU  H'3FA2'
T4CLKCON         EQU  H'3FA2'
T4RST            EQU  H'3FA3'
TMR3L            EQU  H'3FA4'
TMR3H            EQU  H'3FA5'
T3CON            EQU  H'3FA6'
TMR3CON          EQU  H'3FA6'
T3GCON           EQU  H'3FA7'
TMR3GCON         EQU  H'3FA7'
T3GATE           EQU  H'3FA8'
TMR3GATE         EQU  H'3FA8'
T3CLK            EQU  H'3FA9'
TMR3CLK          EQU  H'3FA9'
T2TMR            EQU  H'3FAA'
TMR2             EQU  H'3FAA'
PR2              EQU  H'3FAB'
T2PR             EQU  H'3FAB'
T2CON            EQU  H'3FAC'
T2HLT            EQU  H'3FAD'
T2CLK            EQU  H'3FAE'
T2CLKCON         EQU  H'3FAE'
T2RST            EQU  H'3FAF'
TMR1L            EQU  H'3FB0'
TMR1H            EQU  H'3FB1'
T1CON            EQU  H'3FB2'
TMR1CON          EQU  H'3FB2'
T1GCON           EQU  H'3FB3'
TMR1GCON         EQU  H'3FB3'
T1GATE           EQU  H'3FB4'
TMR1GATE         EQU  H'3FB4'
T1CLK            EQU  H'3FB5'
TMR1CLK          EQU  H'3FB5'
TMR0             EQU  H'3FB6'
TMR0L            EQU  H'3FB6'
PR0              EQU  H'3FB7'
TMR0H            EQU  H'3FB7'
T0CON0           EQU  H'3FB8'
T0CON1           EQU  H'3FB9'
LATA             EQU  H'3FBA'
LATB             EQU  H'3FBB'
LATC             EQU  H'3FBC'
TRISA            EQU  H'3FC2'
TRISB            EQU  H'3FC3'
TRISC            EQU  H'3FC4'
PORTA            EQU  H'3FCA'
PORTB            EQU  H'3FCB'
PORTC            EQU  H'3FCC'
PORTE            EQU  H'3FCE'
INTCON0          EQU  H'3FD2'
INTCON1          EQU  H'3FD3'
IVTLOCK          EQU  H'3FD4'
IVTBASE          EQU  H'3FD5'
IVTBASEL         EQU  H'3FD5'
IVTBASEH         EQU  H'3FD6'
IVTBASEU         EQU  H'3FD7'
STATUS           EQU  H'3FD8'
FSR2L            EQU  H'3FD9'
FSR2H            EQU  H'3FDA'
PLUSW2           EQU  H'3FDB'
PREINC2          EQU  H'3FDC'
POSTDEC2         EQU  H'3FDD'
POSTINC2         EQU  H'3FDE'
INDF2            EQU  H'3FDF'
BSR              EQU  H'3FE0'
FSR1L            EQU  H'3FE1'
FSR1H            EQU  H'3FE2'
PLUSW1           EQU  H'3FE3'
PREINC1          EQU  H'3FE4'
POSTDEC1         EQU  H'3FE5'
POSTINC1         EQU  H'3FE6'
INDF1            EQU  H'3FE7'
WREG             EQU  H'3FE8'
FSR0L            EQU  H'3FE9'
FSR0H            EQU  H'3FEA'
PLUSW0           EQU  H'3FEB'
PREINC0          EQU  H'3FEC'
POSTDEC0         EQU  H'3FED'
POSTINC0         EQU  H'3FEE'
INDF0            EQU  H'3FEF'
PCON0            EQU  H'3FF0'
PCON1            EQU  H'3FF1'
PROD             EQU  H'3FF3'
PRODL            EQU  H'3FF3'
PRODH            EQU  H'3FF4'
TABLAT           EQU  H'3FF5'
TBLPTR           EQU  H'3FF6'
TBLPTRL          EQU  H'3FF6'
TBLPTRH          EQU  H'3FF7'
TBLPTRU          EQU  H'3FF8'
PC               EQU  H'3FF9'
PCL              EQU  H'3FF9'
PCLATH           EQU  H'3FFA'
PCLATU           EQU  H'3FFB'
STKPTR           EQU  H'3FFC'
TOS              EQU  H'3FFD'
TOSL             EQU  H'3FFD'
TOSH             EQU  H'3FFE'
TOSU             EQU  H'3FFF'

;----- CIOCON Bits -----------------------------------------------------
CLKSEL           EQU  H'0000'
TX1SRC           EQU  H'0007'


;----- RXERRCNT Bits -----------------------------------------------------
REC0             EQU  H'0000'
REC1             EQU  H'0001'
REC2             EQU  H'0002'
REC3             EQU  H'0003'
REC4             EQU  H'0004'
REC5             EQU  H'0005'
REC6             EQU  H'0006'
REC7             EQU  H'0007'



;----- TXERRCNT Bits -----------------------------------------------------
TEC0             EQU  H'0000'
TEC1             EQU  H'0001'
TEC2             EQU  H'0002'
TEC3             EQU  H'0003'
TEC4             EQU  H'0004'
TEC5             EQU  H'0005'
TEC6             EQU  H'0006'
TEC7             EQU  H'0007'



;----- BRGCON1 Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
SJW0             EQU  H'0006'
SJW1             EQU  H'0007'



;----- BRGCON2 Bits -----------------------------------------------------
PRSEG0           EQU  H'0000'
PRSEG1           EQU  H'0001'
PRSEG2           EQU  H'0002'
SEG1PH0          EQU  H'0003'
SEG1PH1          EQU  H'0004'
SEG1PH2          EQU  H'0005'
SAM              EQU  H'0006'
SEG2PHTS         EQU  H'0007'



;----- BRGCON3 Bits -----------------------------------------------------
SEG2PH0          EQU  H'0000'
SEG2PH1          EQU  H'0001'
SEG2PH2          EQU  H'0002'
WAKFIL           EQU  H'0006'
WAKDIS           EQU  H'0007'



;----- RXFCON0 Bits -----------------------------------------------------
RXF0EN           EQU  H'0000'
RXF1EN           EQU  H'0001'
RXF2EN           EQU  H'0002'
RXF3EN           EQU  H'0003'
RXF4EN           EQU  H'0004'
RXF5EN           EQU  H'0005'
RXF6EN           EQU  H'0006'
RXF7EN           EQU  H'0007'


;----- RXFCON1 Bits -----------------------------------------------------
RXF8EN           EQU  H'0000'
RXF9EN           EQU  H'0001'
RXF10EN          EQU  H'0002'
RXF11EN          EQU  H'0003'
RXF12EN          EQU  H'0004'
RXF13EN          EQU  H'0005'
RXF14EN          EQU  H'0006'
RXF15EN          EQU  H'0007'


;----- RXF6SIDH Bits -----------------------------------------------------
SID3             EQU  H'0000'
SID4             EQU  H'0001'
SID5             EQU  H'0002'
SID6             EQU  H'0003'
SID7             EQU  H'0004'
SID8             EQU  H'0005'
SID9             EQU  H'0006'
SID10            EQU  H'0007'

EID21            EQU  H'0000'
EID22            EQU  H'0001'
EID23            EQU  H'0002'
EID24            EQU  H'0003'
EID25            EQU  H'0004'
EID26            EQU  H'0005'
EID27            EQU  H'0006'
EID28            EQU  H'0007'



;----- RXF6SIDL Bits -----------------------------------------------------
EID16            EQU  H'0000'
EID17            EQU  H'0001'
EXIDF            EQU  H'0003'
SID0             EQU  H'0005'
SID1             EQU  H'0006'
SID2             EQU  H'0007'

EID18            EQU  H'0005'
EID19            EQU  H'0006'
EID20            EQU  H'0007'



;----- RXF6EIDH Bits -----------------------------------------------------
EID8             EQU  H'0000'
EID9             EQU  H'0001'
EID10            EQU  H'0002'
EID11            EQU  H'0003'
EID12            EQU  H'0004'
EID13            EQU  H'0005'
EID14            EQU  H'0006'
EID15            EQU  H'0007'



;----- RXF6EIDL Bits -----------------------------------------------------
EID0             EQU  H'0000'
EID1             EQU  H'0001'
EID2             EQU  H'0002'
EID3             EQU  H'0003'
EID4             EQU  H'0004'
EID5             EQU  H'0005'
EID6             EQU  H'0006'
EID7             EQU  H'0007'



