GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18lf26k83.inc
;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
HLVDIE           EQU  H'0001'
OSFIE            EQU  H'0002'
CSWIE            EQU  H'0003'
NVMIE            EQU  H'0004'
SCANIE           EQU  H'0005'
CRCIE            EQU  H'0006'
IOCIE            EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
ZCDIE            EQU  H'0001'
ADIE             EQU  H'0002'
ADTIE            EQU  H'0003'
C1IE             EQU  H'0004'
SMT1IE           EQU  H'0005'
SMT1PRAIE        EQU  H'0006'
SMT1PWAIE        EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
DMA1SCNTIE       EQU  H'0000'
DMA1DCNTIE       EQU  H'0001'
DMA1ORIE         EQU  H'0002'
DMA1AIE          EQU  H'0003'
SPI1RXIE         EQU  H'0004'
SPI1TXIE         EQU  H'0005'
SPI1IE           EQU  H'0006'
I2C1RXIE         EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
I2C1TXIE         EQU  H'0000'
I2C1IE           EQU  H'0001'
I2C1EIE          EQU  H'0002'
U1RXIE           EQU  H'0003'
U1TXIE           EQU  H'0004'
U1EIE            EQU  H'0005'
U1IE             EQU  H'0006'
TMR0IE           EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
TMR1IE           EQU  H'0000'
TMR1GIE          EQU  H'0001'
TMR2IE           EQU  H'0002'
CCP1IE           EQU  H'0003'
NCO1IE           EQU  H'0004'
CWG1IE           EQU  H'0005'
CLC1IE           EQU  H'0006'
INT1IE           EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
RXB0IE           EQU  H'0000'
RXB1IE           EQU  H'0001'
TXB0IE           EQU  H'0002'
TXB1IE           EQU  H'0003'
TXB2IE           EQU  H'0004'
ERRIE            EQU  H'0005'
WAKIE            EQU  H'0006'
IRXIE            EQU  H'0007'

FIFOFIE          EQU  H'0000'
RXBnIE           EQU  H'0001'
TXBnIE           EQU  H'0004'

FIFOWMIE         EQU  H'0000'


;----- PIE6 Bits -----------------------------------------------------
C2IE             EQU  H'0000'
SMT2IE           EQU  H'0001'
SMT2PRAIE        EQU  H'0002'
SMT2PWAIE        EQU  H'0003'
DMA2SCNTIE       EQU  H'0004'
DMA2DCNTIE       EQU  H'0005'
DMA2ORIE         EQU  H'0006'
DMA2AIE          EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
I2C2RXIE         EQU  H'0000'
I2C2TXIE         EQU  H'0001'
I2C2IE           EQU  H'0002'
I2C2EIE          EQU  H'0003'
U2RXIE           EQU  H'0004'
U2TXIE           EQU  H'0005'
U2EIE            EQU  H'0006'
U2IE             EQU  H'0007'


;----- PIE8 Bits -----------------------------------------------------
TMR3IE           EQU  H'0000'
TMR3GIE          EQU  H'0001'
TMR4IE           EQU  H'0002'
CCP2IE           EQU  H'0003'
CWG2IE           EQU  H'0004'
CLC2IE           EQU  H'0005'
INT2IE           EQU  H'0006'
TMR5IE           EQU  H'0007'


;----- PIE9 Bits -----------------------------------------------------
TMR5GIE          EQU  H'0000'
TMR6IE           EQU  H'0001'
CCP3IE           EQU  H'0002'
CWG3IE           EQU  H'0003'
CLC3IE           EQU  H'0004'
CCP4IE           EQU  H'0005'
CLC4IE           EQU  H'0006'


;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
HLVDIF           EQU  H'0001'
OSFIF            EQU  H'0002'
CSWIF            EQU  H'0003'
NVMIF            EQU  H'0004'
SCANIF           EQU  H'0005'
CRCIF            EQU  H'0006'
IOCIF            EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
ZCDIF            EQU  H'0001'
ADIF             EQU  H'0002'
ADTIF            EQU  H'0003'
C1IF             EQU  H'0004'
SMT1IF           EQU  H'0005'
SMT1PRAIF        EQU  H'0006'
SMT1PWAIF        EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
DMA1SCNTIF       EQU  H'0000'
DMA1DCNTIF       EQU  H'0001'
DMA1ORIF         EQU  H'0002'
DMA1AIF          EQU  H'0003'
SPI1RXIF         EQU  H'0004'
SPI1TXIF         EQU  H'0005'
SPI1IF           EQU  H'0006'
I2C1RXIF         EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
I2C1TXIF         EQU  H'0000'
I2C1IF           EQU  H'0001'
I2C1EIF          EQU  H'0002'
U1RXIF           EQU  H'0003'
U1TXIF           EQU  H'0004'
U1EIF            EQU  H'0005'
U1IF             EQU  H'0006'
TMR0IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
TMR1IF           EQU  H'0000'
TMR1GIF          EQU  H'0001'
TMR2IF           EQU  H'0002'
CCP1IF           EQU  H'0003'
NCO1IF           EQU  H'0004'
CWG1IF           EQU  H'0005'
CLC1IF           EQU  H'0006'
INT1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
RXB0IF           EQU  H'0000'
RXB1IF           EQU  H'0001'
TXB0IF           EQU  H'0002'
TXB1IF           EQU  H'0003'
TXB2IF           EQU  H'0004'
ERRIF            EQU  H'0005'
WAKIF            EQU  H'0006'
IRXIF            EQU  H'0007'

FIFOFIF          EQU  H'0000'
RXBnIF           EQU  H'0001'
TXBnIF           EQU  H'0004'

FIFOWMIF         EQU  H'0000'


;----- PIR6 Bits -----------------------------------------------------
C2IF             EQU  H'0000'
SMT2IF           EQU  H'0001'
SMT2PRAIF        EQU  H'0002'
SMT2PWAIF        EQU  H'0003'
DMA2SCNTIF       EQU  H'0004'
DMA2DCNTIF       EQU  H'0005'
DMA2ORIF         EQU  H'0006'
DMA2AIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
I2C2RXIF         EQU  H'0000'
I2C2TXIF         EQU  H'0001'
I2C2IF           EQU  H'0002'
I2C2EIF          EQU  H'0003'
U2RXIF           EQU  H'0004'
U2TXIF           EQU  H'0005'
U2EIF            EQU  H'0006'
U2IF             EQU  H'0007'


;----- PIR8 Bits -----------------------------------------------------
TMR3IF           EQU  H'0000'
TMR3GIF          EQU  H'0001'
TMR4IF           EQU  H'0002'
CCP2IF           EQU  H'0003'
CWG2IF           EQU  H'0004'
CLC2IF           EQU  H'0005'
INT2IF           EQU  H'0006'
TMR5IF           EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
TMR5GIF          EQU  H'0000'
TMR6IF           EQU  H'0001'
CCP3IF           EQU  H'0002'
CWG3IF           EQU  H'0003'
CLC3IF           EQU  H'0004'
CCP4IF           EQU  H'0005'
CLC4IF           EQU  H'0006'


